# EDUNET FOUNDATION - Self-Practice Exercise Notebook

# LAB 7- Python Connection with Database

Problem 1 create a table named EMPLOYEE in MySQL with five columns namely, FIRST_NAME,AGE, SEX and, INCOME.

In [10]:
import sqlite3
connection = sqlite3.connect('mydatabase.db')
cursor = connection.cursor()
cursor.execute('CREATE TABLE IF NOT EXISTS mytable (FIRST_NAME VARCHAR(255), AGE INT, SEX CHAR(1), INCOME DECIMAL(10, 2))')
insert_query = "INSERT INTO mytable (FIRST_NAME, AGE, SEX, INCOME) VALUES (?, ?, ?, ?)"
values = ('ABCD', 20, 'F', 5000.00)
cursor.execute(insert_query, values)
values1 = ('EFGH', 17, 'M', 3000.00)
cursor.execute(insert_query, values1)
values2 = ('IJKL', 18, 'F', 8000.00)
cursor.execute(insert_query, values2)
values3 = ('MNOP', 22, 'M', 6000.00)
cursor.execute(insert_query, values3)
connection.commit()
connection.close()

Problem 2: Display created table using SELECT

In [6]:
import sqlite3
connection = sqlite3.connect('mydatabase.db')
cursor = connection.cursor()
cursor.execute('SELECT * FROM mytable')
for row in cursor.fetchall():
    print(row)
connection.commit()
connection.close()

('ABCD', 20, 'F', 5000)
('EFGH', 17, 'M', 3000)
('IJKL', 18, 'F', 8000)
('MNOP', 22, 'M', 6000)

Problem 3:Write a MySQL statement which retrieves the records of the employees whose income is greater than 4000.

In [9]:
import sqlite3
connection=sqlite3.connect('mydatabase.db')
cursor=connection.cursor()
cursor.execute("SELECT * FROM mytable WHERE INCOME>=4000")
for row in cursor.fetchall():
    print(row)
connection.commit()
connection.close()

('ABCD', 20, 'F', 5000)
('IJKL', 18, 'F', 8000)
('MNOP', 22, 'M', 6000)
('ABCD', 20, 'F', 5000)
('IJKL', 18, 'F', 8000)
('MNOP', 22, 'M', 6000)